In [1]:
import pandas as pd

In [2]:
# Read in csv that has temperature from 2012 - 2017.

temp_df = pd.read_csv('./data/temperature.csv')

In [3]:
temp_df.shape

(45253, 37)

In [4]:
temp_df['New York'].isnull().sum()

793

In [5]:
# The temperature data is for different cities.

temp_df.columns

Index(['datetime', 'Vancouver', 'Portland', 'San Francisco', 'Seattle',
       'Los Angeles', 'San Diego', 'Las Vegas', 'Phoenix', 'Albuquerque',
       'Denver', 'San Antonio', 'Dallas', 'Houston', 'Kansas City',
       'Minneapolis', 'Saint Louis', 'Chicago', 'Nashville', 'Indianapolis',
       'Atlanta', 'Detroit', 'Jacksonville', 'Charlotte', 'Miami',
       'Pittsburgh', 'Toronto', 'Philadelphia', 'New York', 'Montreal',
       'Boston', 'Beersheba', 'Tel Aviv District', 'Eilat', 'Haifa',
       'Nahariyya', 'Jerusalem'],
      dtype='object')

In [6]:
temp_df.tail()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
45248,2017-11-29 20:00:00,NaN,282.00,NaN,280.82,293.55,292.15,289.54,294.71,285.72,...,290.24,NaN,275.13,288.08,NaN,NaN,NaN,NaN,NaN,NaN
45249,2017-11-29 21:00:00,NaN,282.89,NaN,281.65,295.68,292.74,290.61,295.59,286.45,...,289.24,NaN,274.13,286.02,NaN,NaN,NaN,NaN,NaN,NaN
45250,2017-11-29 22:00:00,NaN,283.39,NaN,282.75,295.96,292.58,291.34,296.25,286.44,...,286.78,NaN,273.48,283.94,NaN,NaN,NaN,NaN,NaN,NaN
45251,2017-11-29 23:00:00,NaN,283.02,NaN,282.96,295.65,292.61,292.15,297.15,286.14,...,284.57,NaN,272.48,282.17,NaN,NaN,NaN,NaN,NaN,NaN
45252,2017-11-30 00:00:00,NaN,282.28,NaN,283.04,294.93,291.40,291.64,297.15,284.70,...,283.42,NaN,271.80,280.65,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
# Filtered data for 2017 only.

new_temp_df = temp_df[(temp_df['datetime'] > '2016-12-31 23:00:00')]

In [8]:
new_temp_df[['New York', 'datetime']].shape

(7993, 2)

In [9]:
# Kept only data from New York and datetime column.

ny_temp_df = new_temp_df[['datetime', 'New York']].reset_index().drop(columns = 'index')

In [10]:
ny_temp_df.tail()

                 datetime  New York
7988  2017-11-29 20:00:00       NaN
7989  2017-11-29 21:00:00       NaN
7990  2017-11-29 22:00:00       NaN
7991  2017-11-29 23:00:00       NaN
7992  2017-11-30 00:00:00       NaN

In [ ]:
# To check where NaNs are

# for i in range(7773):
#     print(i, new_temp_df['New York'].iloc[i])

In [13]:
# Dropped NaNs didn't want to do dropna because wasn't sure if NaN was only at end.
df = ny_temp_df.iloc[:7201]

In [14]:
df.isnull().sum()

datetime    0
New York    0
dtype: int64

In [15]:
df.shape

(7201, 2)

In [16]:
df.dtypes

datetime     object
New York    float64
dtype: object

In [17]:
# Changed datetime column to datetime datatype.

df['datetime'] = pd.to_datetime(df['datetime'])

/Users/ixchelfragoso/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [18]:
df.dtypes

datetime    datetime64[ns]
New York           float64
dtype: object

In [21]:
# Set datetime column as index.

df = df.set_index(df['datetime']).sort_index().drop(columns = 'datetime')

In [24]:
df.shape

(7201, 1)

In [29]:
# Aggregated by day to see how much data is condensed. If we do by day, it reduces it to 301 rows from 7201 rows. 

df.resample('d').mean()

              New York
datetime
2017-01-01  279.465417
2017-01-02  274.807500
2017-01-03  277.470833
2017-01-04  279.862083
2017-01-05  272.804167
2017-01-06  271.640417
2017-01-07  268.069167
2017-01-08  266.080000
2017-01-09  264.564583
2017-01-10  267.001667
2017-01-11  279.331667
2017-01-12  283.932083
2017-01-13  284.064167
2017-01-14  272.265833
2017-01-15  272.507500
2017-01-16  272.276250
2017-01-17  276.405833
2017-01-18  276.806250
2017-01-19  277.660417
2017-01-20  277.546667
2017-01-21  279.250417
2017-01-22  280.365833
2017-01-23  278.943333
2017-01-24  276.877792
2017-01-25  277.926708
2017-01-26  280.054583
2017-01-27  278.386250
2017-01-28  275.386667
2017-01-29  275.292917
2017-01-30  273.435833
...                ...
2017-09-29  289.056667
2017-09-30  287.862500
2017-10-01  287.105000
2017-10-02  287.892500
2017-10-03  288.035000
2017-10-04  288.978333
2017-10-05  294.386250
2017-10-06  295.499583
2017-10-07  294.809167
2017-10-08  296.413333
2017-10-09  296.123333
2017-10-10  296.259167
2017-10-11  292.730833
2017-10-12  289.280000
2017-10-13  287.230968
2017-10-14  291.441542
2017-10-15  292.910000
2017-10-16  289.390417
2017-10-17  282.368750
2017-10-18  285.992083
2017-10-19  288.017917
2017-10-20  289.696667
2017-10-21  289.178333
2017-10-22  288.783750
2017-10-23  290.650833
2017-10-24  294.382500
2017-10-25  289.918750
2017-10-26  286.047500
2017-10-27  283.773750
2017-10-28  284.980000

[301 rows x 1 columns]

In [30]:
df.tail()

                     New York
datetime
2017-10-27 20:00:00    289.98
2017-10-27 21:00:00    289.48
2017-10-27 22:00:00    287.92
2017-10-27 23:00:00    285.83
2017-10-28 00:00:00    284.98